# TopographyLinkPath Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TopographyLinkPath Property
ParameterTypeId Class See Also
---
"Saved Path"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TopographyLinkPath { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TopographyLinkPath As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TopographyLinkPath {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace